# Seeding Of Custom Generators

In this notebook we check that two different instances of the same custom generator (here: `QuuxGenerator`) produce the same elements, whereas instances of different custom generators produce different values for their constituent primitive generators, even if they are of the same type and defined in the same position (such as `bb` and `cc` in `QuuxGenerator` and `FoobarGenerator` below).

In [1]:
from tohu import Integer, HashDigest, FakerGenerator, CustomGenerator
from tohu.utils import print_generated_sequence

In [2]:
class QuuxGenerator(CustomGenerator):
    aa = Integer(100, 200)
    bb = HashDigest(length=8)
    cc = Integer(300, 400)

In [3]:
class FoobarGenerator(CustomGenerator):
    aa = FakerGenerator(method="name")
    bb = HashDigest(length=8)
    cc = Integer(300, 400)

In [4]:
g1 = QuuxGenerator()
g2 = QuuxGenerator()
h = FoobarGenerator()

In [5]:
assert g1 is not g2

In [9]:
items_g1 = g1.generate(num=5, seed=12345)
items_g2 = g2.generate(num=5, seed=12345)
items_h = h.generate(num=5, seed=12345)

In [12]:
assert list(items_g1) == list(items_g2)

In [14]:
#assert list(items_g1) != list(items_h)

In [15]:
g1.generate(num=5, seed=12345).to_df()

    aa        bb   cc
0  182  DE799554  306
1  103  741C72C2  362
2  180  F83F5602  390
3  131  5089D8E1  395
4  100  B19FD12B  309

In [16]:
g2.generate(num=5, seed=12345).to_df()

    aa        bb   cc
0  182  DE799554  306
1  103  741C72C2  362
2  180  F83F5602  390
3  131  5089D8E1  395
4  100  B19FD12B  309

In [17]:
h.generate(num=5, seed=12345).to_df()

                    aa        bb   cc
0      Phillip Osborne  94F09072  383
1          Nicole Ware  BE93BA00  377
2    Heather Armstrong  90D02769  379
3  Dr. Cheryl Marshall  C590EABC  334
4  Stephanie Robertson  C4ACB7F0  341